Repository: PHalfStudio/ScrollBridge
Catalog: MouseBridge/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# about.appIcon
source: ScrollBridge app icon
zh_hans: ScrollBridge 应用图标

# about.build
source: Build
zh_hans: 构建号

# about.compatibility
source: Some vendor-specific mouse buttons may not be visible to macOS.
zh_hans: 部分厂商专有鼠标按钮可能无法被 macOS 识别。

# about.copyright
source: Copyright
zh_hans: 版权

# about.gitCommit
source: Git commit
zh_hans: Git 提交

# about.localOnly
source: Input events are processed locally only.
zh_hans: 输入事件只在本机处理。

# about.noClipboard
source: Typed text and clipboard content are not stored.
zh_hans: 不保存键入文本和剪贴板内容。

# about.openSourceLicense
source: Open source licenses
zh_hans: 开源许可

# about.privacy
source: A local menu bar tool for mouse wheel direction, smooth scrolling, and safe button shortcut mapping.
zh_hans: 一个本地运行的菜单栏工具，用于鼠标滚轮方向、平滑滚动和安全的按键快捷键映射。

# about.privacyPolicy
source: Privacy policy
zh_hans: 隐私说明

# about.references
source: Inspired by Mac Mouse Fix, Scroll Reverser, Mos, LinearMouse, and Karabiner-Elements.
zh_hans: 参考 Mac Mouse Fix、Scroll Reverser、Mos、LinearMouse 和 Karabiner-Elements 的公开设计。

# about.updateStatus
source: Update status
zh_hans: 更新状态

# about.updateUnavailable
source: No updater in this version
zh_hans: 此版本不包含自动更新

# about.version
source: Version
zh_hans: 版本

# action.cancel
source: Cancel
zh_hans: 取消

# action.cancel.hint
source: Close the editor without saving changes.
zh_hans: 关闭编辑器且不保存更改。

# action.save
source: Save
zh_hans: 保存

# action.save.hint
source: Save this button mapping and close the editor.
zh_hans: 保存这个按键映射并关闭编辑器。

# device.kind.ignored
source: Ignored
zh_hans: 忽略

# device.kind.keyboard
source: Keyboard
zh_hans: 键盘

# device.kind.mouse
source: Mouse
zh_hans: 鼠标

# device.kind.trackpad
source: Trackpad
zh_hans: 触控板

# device.kind.unknown
source: Unknown
zh_hans: 未知

# devices.classificationNeedsConfirmation
source: Needs manual confirmation
zh_hans: 需要手动确认

# devices.classificationNote
source: Classification
zh_hans: 分类提示

# devices.confidence
source: Confidence
zh_hans: 置信度

# devices.description
source: Current HID devices are listed here. Manual type changes are saved locally.
zh_hans: 这里显示当前 HID 设备，手动类型会保存在本机。

# devices.identity
source: Vendor / product / transport
zh_hans: 厂商 / 产品 / 连接

# devices.kind
source: Device kind
zh_hans: 设备类型

# devices.kind.hint
source: Choose whether this device is treated as a mouse, trackpad, Magic Mouse, keyboard, ignored, or unknown.
zh_hans: 选择将此设备视为鼠标、触控板、Magic Mouse、键盘、忽略或未知设备。

# devices.lastEvent
source: Last event
zh_hans: 最近事件

# devices.refresh
source: Refresh
zh_hans: 刷新

# devices.refresh.hint
source: Refresh the connected device list and classification status.
zh_hans: 刷新已连接设备列表和分类状态。

# devices.row.accessibilityHint
source: Use the picker to override how ScrollBridge treats this device.
zh_hans: 使用选择器调整 ScrollBridge 对此设备的处理方式。

# devices.row.accessibilityLabelFormat
source: Device %@, kind %@, identity %@, usage %@, standard HID %@, confidence %@, last event %@
zh_hans: 设备 %@，分类 %@，标识 %@，用途 %@，标准 HID %@，置信度 %@，最近事件 %@

# devices.standardHID
source: Standard HID
zh_hans: 标准 HID

# devices.standardHID.no
source: No
zh_hans: 否

# devices.standardHID.yes
source: Yes
zh_hans: 是

# devices.usage
source: Usage page / usage
zh_hans: 用途页 / 用途

# diagnostics.accessibility
source: Accessibility
zh_hans: 辅助功能

# diagnostics.averageCallback
source: Average Callback
zh_hans: 平均回调耗时

# diagnostics.callbackMillisecondsFormat
source: %.3f ms
zh_hans: %.3f 毫秒

# diagnostics.conflicts
source: Possible conflicts
zh_hans: 可能冲突

# diagnostics.conflicts.note
source: These apps may also change scrolling or mouse buttons. ScrollBridge only shows this hint and will not close them.
zh_hans: 这些 App 也可能修改滚动或鼠标按键。ScrollBridge 只显示提示，不会关闭它们。

# diagnostics.devices
source: Devices
zh_hans: 已识别设备

# diagnostics.error.cannotCreateEventTap
source: Cannot create event tap.
zh_hans: 无法创建事件监听。

# diagnostics.error.cannotCreateRunLoopSource
source: Cannot create run loop source.
zh_hans: 无法创建运行循环源。

# diagnostics.event.mouseButton
source: Mouse button %d
zh_hans: 鼠标按键 %d

# diagnostics.event.physicalMouseWheel
source: Physical mouse wheel
zh_hans: 物理鼠标滚轮

# diagnostics.event.trackpadScroll
source: Trackpad scroll
zh_hans: 触控板滚动

# diagnostics.eventCount
source: Processed Events
zh_hans: 已处理事件

# diagnostics.eventTap
source: Event Tap
zh_hans: 事件监听

# diagnostics.excludedApps
source: Excluded apps
zh_hans: 排除 App

# diagnostics.export
source: Export
zh_hans: 导出

# diagnostics.exportButton
source: Export Diagnostics
zh_hans: 导出诊断

# diagnostics.exportButton.hint
source: Export a local diagnostics package without typed text or input contents.
zh_hans: 导出不包含键入文本或输入内容的本机诊断包。

# diagnostics.inputMonitoring
source: Input Monitoring
zh_hans: 输入监控

# diagnostics.lastError
source: Last Error
zh_hans: 最近错误

# diagnostics.lastErrorCode
source: Last Error Code
zh_hans: 最近错误码

# diagnostics.lastEvent
source: Last Event
zh_hans: 最近事件

# diagnostics.log.appWillTerminate
source: ScrollBridge is quitting and event monitoring has stopped.
zh_hans: ScrollBridge 正在退出，事件监听已停止。

# diagnostics.log.eventTapDisabledByTimeout
source: Event tap disabled by timeout.
zh_hans: 事件监听因超时被系统停用。

# diagnostics.log.eventTapDisabledByUserInput
source: Event tap disabled by user input.
zh_hans: 事件监听被用户输入保护机制停用。

# diagnostics.log.eventTapDisabledRepeatedly
source: Event tap disabled repeatedly.
zh_hans: 事件监听连续多次被停用。

# diagnostics.log.exported
source: Diagnostics exported.
zh_hans: 诊断信息已导出。

# diagnostics.log.onboardingCompleted
source: Onboarding completed.
zh_hans: 引导已完成。

# diagnostics.log.settingsReset
source: Settings reset.
zh_hans: 设置已恢复默认。

# diagnostics.log.systemDidWake
source: System did wake; refreshing runtime state.
zh_hans: 系统已唤醒，正在刷新运行状态。

# diagnostics.log.systemWillSleep
source: System will sleep; event tap stopped.
zh_hans: 系统即将睡眠，事件监听已停止。

# diagnostics.loginItem
source: Login Item
zh_hans: 登录项

# diagnostics.logs
source: Recent Logs
zh_hans: 最近日志

# diagnostics.noConflicts
source: No common mouse tools detected.
zh_hans: 未检测到常见鼠标工具。

# diagnostics.noDevices
source: No recognized devices yet.
zh_hans: 暂未识别到设备。

# diagnostics.noLogs
source: No logs yet.
zh_hans: 暂无日志。

# diagnostics.p95Callback
source: P95 Callback
zh_hans: P95 回调耗时

# diagnostics.row.accessibilityHint
source: Diagnostic value. Read the label and current value together.
zh_hans: 诊断值。请连同标签和当前值一起读取。

# diagnostics.runtime
source: Runtime
zh_hans: 运行状态

# eventTap.disabledByTimeout
source: Disabled by timeout
zh_hans: 因超时被系统禁用

# eventTap.disabledByUserInput
source: Disabled by user input
zh_hans: 被用户输入禁用

# eventTap.failed
source: Failed
zh_hans: 创建失败

# eventTap.missingPermissions
source: Missing permissions
zh_hans: 缺少权限

# eventTap.running
source: Running
zh_hans: 运行中

# eventTap.stopped
source: Stopped
zh_hans: 已停止

# excludedApps.add
source: Add
zh_hans: 添加

# excludedApps.add.hint
source: Add the typed bundle identifier to the exclusion list.
zh_hans: 将输入的包标识符添加到排除列表。

# excludedApps.chooseApp
source: Choose App…
zh_hans: 选择 App…

# excludedApps.chooseApp.hint
source: Choose an installed app and add its bundle identifier to the exclusion list.
zh_hans: 选择一个已安装 App，并将它的包标识符加入排除列表。

# excludedApps.chooseApp.invalid
source: Could not read this app's bundle identifier.
zh_hans: 无法读取这个 App 的包标识符。

# excludedApps.description
source: Events are passed through unchanged while one of these bundle identifiers is frontmost.
zh_hans: 这些 bundle id（包标识）对应的 App 位于前台时，输入事件会直接放行。

# excludedApps.empty
source: No excluded apps yet.
zh_hans: 暂未添加排除 App。

# excludedApps.placeholder.hint
source: Enter a bundle identifier such as com.example.app.
zh_hans: 输入类似 com.example.app 的包标识符。

# excludedApps.row.accessibilityHint
source: Scroll and button mapping stay unchanged while this app is active.
zh_hans: 当前台 App 是这一项时，滚动和按键映射保持原样。

# excludedApps.row.accessibilityLabelFormat
source: Excluded app: %@
zh_hans: 已排除 App：%@

# feature.notice.missingPermissions
source: Input Monitoring and Accessibility permissions are required before enabled features can affect input.
zh_hans: 授予输入监控和辅助功能权限后，已开启的输入功能才会生效。

# feature.notice.paused
source: The master switch is off, so input features are paused.
zh_hans: 总开关已关闭，输入功能当前暂停。

# feature.notice.setupRequired
source: Complete onboarding before input features apply.
zh_hans: 完成首次设置后，输入功能才会生效。

# general.language
source: Language
zh_hans: 语言

# general.language.hint
source: Choose the language used by settings and menu text.
zh_hans: 选择设置和菜单文字使用的语言。

# general.launchAtLogin
source: Launch at login
zh_hans: 登录时启动 ScrollBridge

# general.launchAtLogin.desc
source: Disabled by default and only changed by the user.
zh_hans: 默认关闭，只在用户主动开启后生效。

# general.launchAtLogin.status
source: Login item status
zh_hans: 登录项状态

# general.masterEnabled
source: Enable ScrollBridge
zh_hans: 启用 ScrollBridge

# general.masterEnabled.desc
source: Stop all event changes when this is off.
zh_hans: 关闭后停止改写任何输入事件。

# general.menuBarVisible
source: Show in menu bar
zh_hans: 在菜单栏显示

# general.menuBarVisible.desc
source: Keep the ScrollBridge menu available from the menu bar.
zh_hans: 保持可以从菜单栏打开 ScrollBridge。

# general.restoreDefaults
source: Restore Defaults
zh_hans: 恢复默认设置

# general.restoreDefaults.hint
source: Reset ScrollBridge settings to their default values.
zh_hans: 将 ScrollBridge 设置恢复为默认值。

# general.showSettingsAtLaunch
source: Show settings at launch
zh_hans: 启动时显示设置窗口

# general.showSettingsAtLaunch.desc
source: Keep menu bar mode by default.
zh_hans: 默认保持菜单栏常驻模式。

# language.system
source: Follow System
zh_hans: 跟随系统

# language.zhHans
source: Simplified Chinese
zh_hans: 简体中文

# login.disabled
source: Disabled
zh_hans: 已关闭

# login.enabled
source: Enabled
zh_hans: 已开启

# login.requiresApproval
source: Requires approval
zh_hans: 需要系统确认

# login.unavailable
source: Unavailable
zh_hans: 不可用

# login.unknown
source: Unknown
zh_hans: 未知

# mapping.add
source: Add Mapping
zh_hans: 添加映射

# mapping.add.hint
source: Create a new mouse button mapping.
zh_hans: 新建一个鼠标按键映射。

# mapping.delete
source: Delete
zh_hans: 删除

# mapping.delete.hint
source: Delete this button mapping.
zh_hans: 删除这个按键映射。

# mapping.duplicateMouseButton
source: This mouse button already has a mapping.
zh_hans: 这个鼠标按键已经有映射。

# mapping.edit
source: Edit
zh_hans: 编辑

# mapping.edit.hint
source: Open this mapping for editing.
zh_hans: 打开这个映射进行编辑。

# mapping.editor.enabled
source: Enabled
zh_hans: 启用

# mapping.editor.enabled.hint
source: Turn this individual mapping on or off.
zh_hans: 开启或关闭当前这条按键映射。

# mapping.editor.middleButtonRisk
source: Middle-click may be used by some apps for tab or paste actions. Keep another way to undo the mapping.
zh_hans: 中键可能被部分 App 用于标签页或粘贴操作，请保留其他方式撤销映射。

# mapping.editor.mouseButton
source: Mouse button
zh_hans: 鼠标按钮

# mapping.editor.mouseButton.hint
source: Choose which mouse button triggers this mapping.
zh_hans: 选择触发这条映射的鼠标按键。

# mapping.editor.mouseButton.record
source: Record mouse button
zh_hans: 录制鼠标按钮

# mapping.editor.mouseButton.record.hint
source: Start listening for the next supported mouse button press.
zh_hans: 开始监听下一次可支持的鼠标按键。

# mapping.editor.mouseButton.recordHint
source: Use the picker or record the next visible mouse button event.
zh_hans: 可使用选择器，或录制下一个可识别的鼠标按钮事件。

# mapping.editor.mouseButton.recording
source: Press a mouse side button within 15 seconds.
zh_hans: 请在 15 秒内按下一个鼠标侧键。

# mapping.editor.mouseButton.unselected
source: Press a mouse button first
zh_hans: 请先按下鼠标按钮

# mapping.editor.name
source: Name
zh_hans: 名称

# mapping.editor.name.hint
source: Optionally enter a display name for this mapping.
zh_hans: 可选填写这条映射的显示名称。

# mapping.editor.note
source: Note
zh_hans: 备注

# mapping.editor.note.hint
source: Optionally enter a note for this mapping.
zh_hans: 可选填写这条映射的备注。

# mapping.editor.presetShortcut
source: Preset shortcut
zh_hans: 预制快捷键

# mapping.editor.presetShortcut.custom
source: Record manually
zh_hans: 手动录制

# mapping.editor.presetShortcut.custom.desc
source: Record a shortcut manually after choosing a mouse button.
zh_hans: 选择鼠标按钮后手动录制快捷键。

# mapping.editor.presetShortcut.hint
source: Choose a common macOS shortcut, or record one manually.
zh_hans: 选择常用 macOS 快捷键，或手动录制一个。

# mapping.editor.rerecord
source: Re-record
zh_hans: 重新录制

# mapping.editor.rerecord.hint
source: Restart shortcut recording for the selected mouse button.
zh_hans: 为选中的鼠标按键重新录制快捷键。

# mapping.editor.scope
source: Scope
zh_hans: 作用范围

# mapping.editor.shortcut
source: Shortcut
zh_hans: 快捷键

# mapping.editor.shortcut.capture
source: Shortcut capture area
zh_hans: 快捷键录制区域

# mapping.editor.shortcut.captureHint
source: Press the target keyboard shortcut. Esc cancels and Delete clears.
zh_hans: 按下目标键盘快捷键。Esc 取消，Delete 清空。

# mapping.editor.shortcut.hint
source: Press one keyboard shortcut within 15 seconds. Esc cancels, Delete clears.
zh_hans: 请在 15 秒内按下一个键盘快捷键。Esc 取消，Delete 清空。

# mapping.editor.shortcut.presetSelected
source: The selected preset shortcut will be used directly.
zh_hans: 将直接使用选中的预制快捷键。

# mapping.editor.shortcut.timeout
source: Recording timed out. Use Re-record to capture again.
zh_hans: 录制已超时，点击“重新录制”后再按快捷键。

# mapping.editor.shortcut.waitForMouseButton
source: Choose a mouse button before recording a shortcut.
zh_hans: 请先选择鼠标按钮，再录制快捷键。

# mapping.editor.title
source: Button Mapping
zh_hans: 按键映射

# mapping.enabled
source: Enable mouse button mapping
zh_hans: 启用鼠标按键映射

# mapping.enabled.hint
source: Turn all mouse button mappings on or off.
zh_hans: 开启或关闭全部鼠标按键映射。

# mapping.lastButton
source: Last button: %d
zh_hans: 最近按下：Button %d

# mapping.preset.applicationWindows
source: Application Windows
zh_hans: 当前 App 窗口

# mapping.preset.applicationWindows.desc
source: Show windows for the current app with Control-Down.
zh_hans: 使用 Control-↓ 查看当前 App 的窗口。

# mapping.preset.appSwitcher
source: App Switcher
zh_hans: App 切换器

# mapping.preset.appSwitcher.desc
source: Open the app switcher with Command-Tab.
zh_hans: 使用 Command-Tab 打开 App 切换器。

# mapping.preset.hideApp
source: Hide Current App
zh_hans: 隐藏当前 App

# mapping.preset.hideApp.desc
source: Hide the current app with Command-H.
zh_hans: 使用 Command-H 隐藏当前 App。

# mapping.preset.minimizeWindow
source: Minimize Window
zh_hans: 最小化窗口

# mapping.preset.minimizeWindow.desc
source: Minimize the front window with Command-M.
zh_hans: 使用 Command-M 最小化当前窗口。

# mapping.preset.missionControl
source: Mission Control
zh_hans: 调度中心

# mapping.preset.missionControl.desc
source: Show all windows with Control-Up.
zh_hans: 使用 Control-↑ 查看全部窗口。

# mapping.preset.screenshotSelection
source: Screenshot Selection
zh_hans: 截取所选区域

# mapping.preset.screenshotSelection.desc
source: Capture a selected area with Command-Shift-4.
zh_hans: 使用 Command-Shift-4 截取所选区域。

# mapping.preset.spaceLeft
source: Move Left a Space
zh_hans: 切到左侧空间

# mapping.preset.spaceLeft.desc
source: Switch to the space on the left with Control-Left Arrow.
zh_hans: 使用 Control-← 切到左侧空间。

# mapping.preset.spaceRight
source: Move Right a Space
zh_hans: 切到右侧空间

# mapping.preset.spaceRight.desc
source: Switch to the space on the right with Control-Right Arrow.
zh_hans: 使用 Control-→ 切到右侧空间。

# mapping.preset.spotlight
source: Spotlight Search
zh_hans: 聚焦搜索

# mapping.preset.spotlight.desc
source: Open Spotlight with Command-Space.
zh_hans: 使用 Command-Space 打开聚焦搜索。

# mapping.privacyNote
source: Only configured shortcuts are sent. Text input, clipboard, scripts, and macros are not recorded.
zh_hans: 只发送用户配置的快捷键，不记录文本输入、剪贴板、脚本或宏。

# mapping.row.accessibilityHint
source: Use Edit to change this mapping, or Delete to remove it.
zh_hans: 使用编辑修改此映射，或使用删除移除此映射。

# mapping.row.accessibilityLabelFormat
source: Button %d, shortcut %@, scope %@, note %@
zh_hans: 按钮 %d，快捷键 %@，作用范围 %@，备注 %@

# mapping.scope.custom
source: Custom scope
zh_hans: 自定义范围

# mapping.scope.global
source: All apps
zh_hans: 所有 App

# mapping.useLastButton
source: Use last button %d
zh_hans: 使用最近按下的 Button %d

# mapping.useLastButton.hint
source: Use the most recently detected mouse button for this mapping.
zh_hans: 将最近检测到的鼠标按键用于这个映射。

# menu.about
source: About ScrollBridge
zh_hans: 关于 ScrollBridge

# menu.about.hint
source: Open version, privacy, and license information.
zh_hans: 打开版本、隐私和许可信息。

# menu.buttonMapping
source: Button mapping
zh_hans: 鼠标按键映射

# menu.buttonMapping.hint
source: Quickly turn mouse button mappings on or off.
zh_hans: 快速开启或关闭鼠标按键映射。

# menu.openPermissionGuide
source: Open permission guide…
zh_hans: 打开权限引导…

# menu.openPermissionGuide.hint
source: Open settings to the permissions and diagnostics page.
zh_hans: 打开设置中的权限与诊断页面。

# menu.openSettings
source: Open Settings…
zh_hans: 打开设置…

# menu.openSettings.hint
source: Open the full ScrollBridge settings window.
zh_hans: 打开完整的 ScrollBridge 设置窗口。

# menu.permissionsDiagnostics
source: Permissions & Diagnostics…
zh_hans: 权限与诊断…

# menu.permissionsDiagnostics.hint
source: Open permissions, device, and event listener diagnostics.
zh_hans: 打开权限、设备和事件监听诊断。

# menu.quit
source: Quit ScrollBridge
zh_hans: 退出 ScrollBridge

# menu.quit.hint
source: Stop ScrollBridge and restore normal system input.
zh_hans: 退出 ScrollBridge 并恢复系统默认输入。

# menu.reverseMouseWheel
source: Reverse mouse wheel
zh_hans: 反转鼠标滚轮

# menu.reverseMouseWheel.hint
source: Quickly turn physical mouse wheel reversal on or off.
zh_hans: 快速开启或关闭物理鼠标滚轮反转。

# menu.smoothScrolling
source: Smooth scrolling
zh_hans: 平滑滚动

# menu.smoothScrolling.hint
source: Quickly turn smooth scrolling on or off.
zh_hans: 快速开启或关闭平滑滚动。

# onboarding.back
source: Back
zh_hans: 上一步

# onboarding.back.hint
source: Return to the previous onboarding step.
zh_hans: 返回上一个引导步骤。

# onboarding.enterSettings
source: Enter Settings
zh_hans: 进入设置

# onboarding.enterSettings.hint
source: Finish onboarding and open settings.
zh_hans: 完成引导并打开设置。

# onboarding.features.desc
source: The default setup keeps trackpad natural scrolling unchanged, reverses physical mouse wheel direction, supports smooth scrolling, and maps side buttons to shortcuts.
zh_hans: 默认保持触控板自然滚动不变，反转物理鼠标滚轮方向，并支持平滑滚动和侧键快捷键映射。

# onboarding.features.title
source: Mouse and trackpad stay separate
zh_hans: 鼠标和触控板分开处理

# onboarding.next
source: Next
zh_hans: 下一步

# onboarding.next.hint
source: Continue to the next onboarding step.
zh_hans: 继续下一个引导步骤。

# onboarding.permissions.desc
source: Input Monitoring identifies mouse events. Accessibility filters and sends only configured events. Auto launch stays off unless you enable it.
zh_hans: 输入监控用于识别鼠标事件，辅助功能用于过滤并发送已配置的事件。开机自启默认关闭，只有主动开启后生效。

# onboarding.permissions.title
source: Permissions are required
zh_hans: 需要系统权限

# onboarding.ready.desc
source: After entering settings, enabled features apply immediately when permissions are authorized. You can turn everything off at any time.
zh_hans: 进入设置后，已开启的功能会在权限满足时立即生效。所有功能都可以随时关闭。

# onboarding.ready.title
source: Ready
zh_hans: 准备完成

# onboarding.welcome.desc
source: ScrollBridge runs locally from the menu bar and improves physical mouse scrolling on macOS.
zh_hans: ScrollBridge 在本机以菜单栏形式运行，用于改善 macOS 上普通鼠标的滚动体验。

# onboarding.welcome.title
source: Welcome to ScrollBridge
zh_hans: 欢迎使用 ScrollBridge

# page.about
source: About
zh_hans: 关于

# page.about.hint
source: Open app version, privacy, and license information.
zh_hans: 打开 App 版本、隐私和许可信息。

# page.buttonMapping
source: Button Mapping
zh_hans: 按键映射

# page.buttonMapping.hint
source: Open mouse button mapping settings.
zh_hans: 打开鼠标按键映射设置。

# page.devices
source: Devices
zh_hans: 设备

# page.devices.hint
source: Open device recognition and classification settings.
zh_hans: 打开设备识别与分类设置。

# page.general
source: General
zh_hans: 通用

# page.general.hint
source: Open general settings.
zh_hans: 打开通用设置。

# page.permissions
source: Permissions & Diagnostics
zh_hans: 权限与诊断

# page.permissions.hint
source: Open permissions and diagnostics.
zh_hans: 打开权限与诊断。

# page.scrollDirection
source: Scroll Direction
zh_hans: 滚动方向

# page.scrollDirection.hint
source: Open mouse wheel direction settings.
zh_hans: 打开鼠标滚轮方向设置。

# page.smoothScroll
source: Smooth Scrolling
zh_hans: 平滑滚动

# page.smoothScroll.hint
source: Open smooth scrolling settings.
zh_hans: 打开平滑滚动设置。

# permission.authorized
source: Authorized
zh_hans: 已授权

# permission.denied
source: Not Authorized
zh_hans: 未授权

# permission.requiresRestart
source: Restart required
zh_hans: 需要重启 App

# permission.unknown
source: Unknown
zh_hans: 未知

# permissions.accessibility.desc
source: Accessibility is used to filter and send only configured input events.
zh_hans: 辅助功能用于过滤并发送用户配置的输入事件。

# permissions.actionHint.denied
source: Grant this permission in System Settings, then recheck.
zh_hans: 请在系统设置中授权，然后重新检测。

# permissions.actionHint.requiresRestart
source: Quit and reopen ScrollBridge for the new permission to take effect.
zh_hans: 请退出并重新打开 ScrollBridge，让新权限生效。

# permissions.actionHint.unknown
source: Open System Settings and verify this permission manually.
zh_hans: 请打开系统设置手动确认此权限。

# permissions.inputMonitoring.desc
source: Input Monitoring is used to identify mouse and keyboard events.
zh_hans: 输入监控用于识别鼠标和键盘事件。

# permissions.openAccessibility
source: Open Accessibility
zh_hans: 打开辅助功能设置

# permissions.openAccessibility.hint
source: Open System Settings to grant or remove Accessibility permission.
zh_hans: 打开系统设置，用于授予或移除辅助功能权限。

# permissions.openInputMonitoring
source: Open Input Monitoring
zh_hans: 打开输入监控设置

# permissions.openInputMonitoring.hint
source: Open System Settings to grant or remove Input Monitoring permission.
zh_hans: 打开系统设置，用于授予或移除输入监控权限。

# permissions.privacyCopy
source: ScrollBridge processes input events locally. It does not upload input, store typed text, or read the clipboard.
zh_hans: ScrollBridge 只在本机处理输入事件，不上传输入内容，不保存键入文本，也不读取剪贴板。

# permissions.recheck
source: Recheck
zh_hans: 重新检测

# permissions.recheck.hint
source: Refresh permission, login item, device, and event listener status.
zh_hans: 刷新权限、登录项、设备和事件监听状态。

# permissions.request
source: Request
zh_hans: 请求授权

# permissions.request.accessibility
source: Request Accessibility permission
zh_hans: 请求辅助功能权限

# permissions.request.accessibility.hint
source: Opens the system prompt or settings for changing and sending configured input events.
zh_hans: 打开系统提示或设置，用于改写和发送已配置的输入事件。

# permissions.request.inputMonitoring
source: Request Input Monitoring permission
zh_hans: 请求输入监控权限

# permissions.request.inputMonitoring.hint
source: Opens the system prompt or settings for reading mouse and keyboard events.
zh_hans: 打开系统提示或设置，用于读取鼠标和键盘事件。

# permissions.reset.body
source: To revoke ScrollBridge permissions, open System Settings > Privacy & Security, then remove ScrollBridge from Input Monitoring and Accessibility. Reopen the app and recheck permissions afterward.
zh_hans: 要撤销 ScrollBridge 权限，请打开“系统设置 > 隐私与安全性”，在“输入监控”和“辅助功能”中移除 ScrollBridge。之后重新打开应用并重新检测权限。

# permissions.reset.title
source: Reset permissions
zh_hans: 重置权限说明

# permissions.title
source: Permissions
zh_hans: 权限

# scroll.magicMouse.note
source: Magic Mouse is closer to a touch surface and is not treated as a normal wheel by default. Use device overrides when needed.
zh_hans: Magic Mouse 更接近触控表面，默认不作为普通滚轮处理。需要时可在设备页手动指定。

# scroll.magicMouse.strategy
source: Magic Mouse handling
zh_hans: Magic Mouse 处理策略

# scroll.magicMouse.strategy.hint
source: Choose how Magic Mouse scrolling is handled.
zh_hans: 选择如何处理 Magic Mouse 滚动。

# scroll.magicMouse.strategy.preserve
source: Keep system behavior
zh_hans: 保持系统行为

# scroll.magicMouse.strategy.reverseLikeMouse
source: Reverse like a wheel mouse
zh_hans: 按普通鼠标反转

# scroll.physicalWheelOnly
source: Only physical wheel events
zh_hans: 仅物理滚轮生效

# scroll.physicalWheelOnly.desc
source: Continuous trackpad-like events are ignored.
zh_hans: 忽略类似触控板的连续滚动事件。

# scroll.preserveTrackpad
source: Keep trackpad direction
zh_hans: 保持触控板方向
